create_clock -period 20.000 -name clock -waveform {0.000 10.000} [get_ports clock]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports {bus_addr[*]}]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports {bus_addr[*]}]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports {bus_bend[*]}]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports {bus_bend[*]}]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports {bus_cpat[*]}]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports {bus_cpat[*]}]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports {bus_cs[*]}]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports {bus_cs[*]}]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports {bus_hstr[*]}]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports {bus_hstr[*]}]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports {bus_ph_rpc[*]}]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports {bus_ph_rpc[*]}]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports {bus_q[*]}]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports {bus_q[*]}]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports {bus_r_in[*]}]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports {bus_r_in[*]}]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports {bus_sel[*]}]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports {bus_sel[*]}]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports {bus_th_rpc[*]}]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports {bus_th_rpc[*]}]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports {bus_vpf[*]}]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports {bus_vpf[*]}]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports {bus_wg[*]}]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports {bus_wg[*]}]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports {bus_endcap[0]}]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports {bus_endcap[0]}]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports {bus_lat_test[0]}]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports {bus_lat_test[0]}]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports {bus_we[0]}]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports {bus_we[0]}]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports feed_in_addr]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports feed_in_addr]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports feed_in_bend]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports feed_in_bend]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports feed_in_cpat]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports feed_in_cpat]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports feed_in_cs]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports feed_in_cs]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports feed_in_endcap]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports feed_in_endcap]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports feed_in_hstr]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports feed_in_hstr]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports feed_in_lat_test]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports feed_in_lat_test]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports feed_in_ph_rpc]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports feed_in_ph_rpc]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports feed_in_q]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports feed_in_q]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports feed_in_r_in]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports feed_in_r_in]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports feed_in_sel]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports feed_in_sel]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports feed_in_th_rpc]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports feed_in_th_rpc]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports feed_in_vpf]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports feed_in_vpf]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports feed_in_we]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports feed_in_we]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports feed_in_wg]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports feed_in_wg]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports feed_out_model_out]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports feed_out_model_out]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports load_out_model_out]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports load_out_model_out]
set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports reset]
set_input_delay -clock [get_clocks clock] -max -add_delay 3.000 [get_ports reset]
set_output_delay -clock [get_clocks clock] -min -add_delay 0.000 [get_ports {bus_model_out[*]}]
set_output_delay -clock [get_clocks clock] -max -add_delay 1.100 [get_ports {bus_model_out[*]}]
